//******************************************************************************
// Имя файла    :       stp_mib2.h
// Заголовок    :       
// Автор        :       Сосновских А.А.
// Дата         :       29.11.2018
//
//------------------------------------------------------------------------------
/**
База данных MIB2 параметров RSTP по IEEE 802.1d

**/

#ifndef __STP_MIB2_H
#define __STP_MIB2_H

//Разрешение чтения значений
#define SNMP_ENABLE_GET_VALUES
//Разрешение записи значений
#define SNMP_ENABLE_SETTINGS

#ifdef SNMP_ENABLE_SETTINGS
  //Разрешение записи всех значений
  #define SNMP_ENABLE_SETTINGS_FULL
#endif

#endif //__STP_MIB2_H
